<?php
function nameGeneration($warehouses)
{
    $sizeName = rand(2, 3);
    $i = 0;
    $name = '';
    while($i < $sizeName) {
        $randIndex = rand(0, count($warehouses) - 1);
        $name .= $warehouses[$randIndex];
        $i++;
    }
    return $name;
}

$warehouses = [
    'ма', 'мо', 'му', 'ме', 'ми', 'мі', 'мя', 'мю',
    'на', 'но', 'ну', 'не', 'ни', 'ні', 'ня', 'ню', 'нє',
    'са', 'со', 'су', 'се', 'си', 'сі', 'ся', 'сю',
    'ла', 'ло', 'лу', 'ле', 'ли', 'лі', 'ля', 'лю',
    'ка', 'ко', 'ку', 'ке', 'ки', 'кі',       'кю',
    'ра', 'ро', 'ру', 'ре', 'ри', 'рі', 'ря', 'рю',
    'та', 'то', 'ту', 'те', 'ти', 'ті', 'тя', 'тю',
    'па', 'по', 'пу', 'пе', 'пи', 'пі', 'пя', 'пю',
    'ва', 'во', 'ву', 'ве', 'ви', 'ві', 'вя',
    'ша', 'шо', 'шу', 'ше', 'ши', 'ші',
    'да', 'до', 'ду', 'де', 'ди', 'ді', 'дя', 'дю',
    'за', 'зо', 'зу', 'зе', 'зи', 'зі', 'зя', 'зю',
    'ба', 'бо', 'бу', 'бе', 'би', 'бі', 'бя', 'бю',
    'жа', 'жо', 'жу', 'же', 'жи', 'жі',
    'ца', 'цо', 'цу', 'це', 'ци', 'ці', 'ця', 'цю',
    'га', 'го', 'гу', 'ге', 'ги', 'гі',
    'ча', 'чо', 'чу', 'че', 'чи', 'чі',
    'ха', 'хо', 'ху', 'хе', 'хи', 'хі',
    'ща', 'що', 'щу', 'ще', 'щи', 'щі',
    'фа', 'фо', 'фу', 'фе', 'фи', 'фі',       'фю',
];
?>

<html>
<head>
    <style>
        p {
            font-size: 30px;
        }
        b {
            color: red;
        }
    </style>
</head>
<body>
<?php
echo "<p><b>Кішка:</b> " . nameGeneration($warehouses) . "</p>";
echo "<p><b>Собака:</b> " . nameGeneration($warehouses) . "</p>";
echo "<p><b>Хом'ячок:</b> " . nameGeneration($warehouses) . "</p>";
?>
</body>
</html>
